In [ ]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
s = pd.Series([4,8,15,16,23,42])
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [11]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [9]:
a = [1,2,4,5,7,8,4,5,7,8]
pd.Series(a)

0    1
1    2
2    4
3    5
4    7
5    8
6    4
7    5
8    7
9    8
dtype: int64

In [ ]:
# Q3. Create a Pandas DataFrame that contains the following data:

In [12]:
d = pd.read_csv("Rutuja.csv")
d

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    male
2  Claire   27  Female

In [ ]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [14]:
#Series is homogenous contain list value in single brackets

s = pd.Series([1,2,3])
type(s)

pandas.core.series.Series

In [7]:
# DataFrame is hetrogenous contain list value in 2 bracket and more

s = pd.DataFrame([1,2,3])
type(s)

pandas.core.frame.DataFrame

In [ ]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [8]:
# head top value
s.head(1)

   0
0  1

In [9]:
# tail bottom value
s.tail(1)

   0
2  3

In [10]:
# how much length 
len(s)

3

In [17]:
#exact column can find 
s.columns

RangeIndex(start=0, stop=1, step=1)

In [ ]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
The mutable is list, dictionary,set, DataFrame

In [ ]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [39]:
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis = 1)
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000